Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetOptions Method
Overload List
Name | Description
GetOptions(List<KeyValuePair<Double, String>>)
 Gets the value options of a double property. Option strings are translated when translation is available.
GetOptions(List<KeyValuePair<Int32, String>>)
 Gets the value options of an integer property. Option strings are translated when translation is available.
GetOptions(List<KeyValuePair<String, String>>)
 Gets the value options of a string property. Option strings are translated when translation is available.
GetOptions(List<KeyValuePair<Double, String>>, Boolean)
 Gets the value options of a double property.
GetOptions(List<KeyValuePair<Int32, String>>, Boolean)
 Gets the value options of an integer property.
GetOptions(List<KeyValuePair<String, String>>, Boolean)
 Gets the value options of a string property.
Top
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace